---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.CalculateLengthPerArea
source: html/6a58bee3-1814-30bc-5369-e78fa3e5f268.htm
---
# Autodesk.Revit.DB.FillGrid.CalculateLengthPerArea Method

Calculates length of the pattern per unit area.

## Syntax (C#)
```csharp
public double CalculateLengthPerArea()
```

## Returns
The length per area.